import re


dictionary = {

    "first_question":
        "\\bда\\b|ага|угу|давай\S{0,2}|хорошо|мог\S{0,2}|не против|непротив|можно|может быть|"
        "мб|конечно|возможно|говно вопрос|го|похуй\S{0,1}|как нехуй|до пизды|поебать|задавай\S{0,2}|"
        "спрашивай\S{0,2}|\S{0,2}смотр\S{0,3}|\S{0,2}гля\S{0,4}|нужно|надо",

    "second_question":
        "\\bнол\S\\b|один\S{0,3}|\\bдва\\b|\\bтри\\b|четыре|\\bпять\\b|шесть|\\b\S{0,2}семь\\b|девять|десять|десяти|"
        "едини\S{0,3}|двоечка|двойка|троечка|тройка|троебан|четверочка|четверка|пятер/S{0,4}|шестерочка|шестерка|семерочка|"
        "семерка|восьмер\S{0,4}|девят\S{0,4}|десят\S{0,4}",

    "third_question":
        "\\bнол\S\\b|один\S{0,3}|\\bдва\\b|\\bтри\\b|четыре|\\bпять\\b|шесть|\\b\S{0,2}семь\\b|девять|десять|\\bсяти\\b"
        "едини\S{0,3}|двоечка|двойка|троечка|тройка|троебан|четверочка|четверка|пятер/S{0,4}|шестерочка|шестерка|семерочка|"
        "семерка|восьмер\S{0,4}|девят\S{0,4}|десят\S{0,4}",

    "interruption":
        "нет|не хочу|не буду|не надо|отстань\S{0,2}|отвянь\S{0,2}|отвали\S{0,2}|отъеби\S{0,4}|не интересует|нахуй надо|"
        "иди на хуй\S{0,2}|на хуй иди\S{0,2}|пошёл на хуй|на хуй пошёл|иди в пизду\S{0,3}|в пизд\S{0,3} иди|"
        "пиздуй|попиздовал|досвидания|перестань\S{0,2} мне|не звони\S{0,2}|заеб\S{0,7}"
}

# text = 'ноль один'
# s = re.findall(dictionary['second_question'], text)
# print(s)